### Importing libraries

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os #to get the filesize

### Reading the zomato dataset

In [4]:
df = pd.read_csv(r"C:\Users\n.rahman\OneDrive - BALADNA\Desktop\BALADNA\Ex Docs\SCALER-DSML\Module 6 - DAV - Pandas\zomato.csv")

## EDA

In [5]:
df.head()

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
0,https://www.zomato.com/bangalore/jalsa-banasha...,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,"[('Rated 4.0', 'RATED\n A beautiful place to ...",[],Buffet,Banashankari
1,https://www.zomato.com/bangalore/spice-elephan...,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,"[('Rated 4.0', 'RATED\n Had been here for din...",[],Buffet,Banashankari
2,https://www.zomato.com/SanchurroBangalore?cont...,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,"[('Rated 3.0', ""RATED\n Ambience is not that ...",[],Buffet,Banashankari
3,https://www.zomato.com/bangalore/addhuri-udupi...,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,"[('Rated 4.0', ""RATED\n Great food and proper...",[],Buffet,Banashankari
4,https://www.zomato.com/bangalore/grand-village...,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,"[('Rated 4.0', 'RATED\n Very good restaurant ...",[],Buffet,Banashankari

In [6]:
df.tail()

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
51712,https://www.zomato.com/bangalore/best-brews-fo...,"Four Points by Sheraton Bengaluru, 43/3, White...",Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.6 /5,27,080 40301477,Whitefield,Bar,NaN,Continental,"1,500","[('Rated 5.0', ""RATED\n Food and service are ...",[],Pubs and bars,Whitefield
51713,https://www.zomato.com/bangalore/vinod-bar-and...,"Number 10, Garudachar Palya, Mahadevapura, Whi...",Vinod Bar And Restaurant,No,No,NaN,0,+91 8197675843,Whitefield,Bar,NaN,Finger Food,600,[],[],Pubs and bars,Whitefield
51714,https://www.zomato.com/bangalore/plunge-sherat...,Sheraton Grand Bengaluru Whitefield Hotel & Co...,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,NaN,0,NaN,Whitefield,Bar,NaN,Finger Food,"2,000",[],[],Pubs and bars,Whitefield
51715,https://www.zomato.com/bangalore/chime-sherato...,Sheraton Grand Bengaluru Whitefield Hotel & Co...,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.3 /5,236,080 49652769,"ITPL Main Road, Whitefield",Bar,"Cocktails, Pizza, Buttermilk",Finger Food,"2,500","[('Rated 4.0', 'RATED\n Nice and friendly pla...",[],Pubs and bars,Whitefield
51716,https://www.zomato.com/bangalore/the-nest-the-...,"ITPL Main Road, KIADB Export Promotion Industr...",The Nest - The Den Bengaluru,No,No,3.4 /5,13,+91 8071117272,"ITPL Main Road, Whitefield","Bar, Casual Dining",NaN,"Finger Food, North Indian, Continental","1,500","[('Rated 5.0', 'RATED\n Great ambience , look...",[],Pubs and bars,Whitefield

### Quick info about the dataset

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 17 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   url                          51717 non-null  object
 1   address                      51717 non-null  object
 2   name                         51717 non-null  object
 3   online_order                 51717 non-null  object
 4   book_table                   51717 non-null  object
 5   rate                         43942 non-null  object
 6   votes                        51717 non-null  int64
 7   phone                        50509 non-null  object
 8   location                     51696 non-null  object
 9   rest_type                    51490 non-null  object
 10  dish_liked                   23639 non-null  object
 11  cuisines                     51672 non-null  object
 12  approx_cost(for two people)  51371 non-null  object
 13  reviews_list                 51717 non-null  object
 14  menu_item                    51717 non-null  object
 15  listed_in(type)              51717 non-null  object
 16  listed_in(city)              51717 non-null  object
dtypes: int64(1), object(16)
memory usage: 6.7+ MB

In [8]:
len(df)

51717

### NUmber of columns and rows

In [9]:
df.shape #rows,columns

(51717, 17)

### Checking the size of file

In [10]:
filesize = os.path.getsize(r"C:\Users\n.rahman\OneDrive - BALADNA\Desktop\BALADNA\Ex Docs\SCALER-DSML\Module 6 - DAV - Pandas\zomato.csv")

In [11]:
filesize

574072999

### List of colums names

In [12]:
df.columns

Index(['url', 'address', 'name', 'online_order', 'book_table', 'rate', 'votes',
       'phone', 'location', 'rest_type', 'dish_liked', 'cuisines',
       'approx_cost(for two people)', 'reviews_list', 'menu_item',
       'listed_in(type)', 'listed_in(city)'],
      dtype='object')

## CLEANING DATA
#### Removing columns that we don’t need for our analysis

In [13]:
df.drop(['url', 'address', 'phone', 'menu_item', 'dish_liked', 'reviews_list', 'rest_type','listed_in(city)'], axis=1, inplace=True)

In [14]:
df.head()

,name,online_order,book_table,rate,votes,location,cuisines,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,Banashankari,"North Indian, Mughlai, Chinese",800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,Banashankari,"Chinese, North Indian, Thai",800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,Banashankari,"Cafe, Mexican, Italian",800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,Banashankari,"South Indian, North Indian",300,Buffet
4,Grand Village,No,No,3.8/5,166,Basavanagudi,"North Indian, Rajasthani",600,Buffet

In [15]:
df.tail()

,name,online_order,book_table,rate,votes,location,cuisines,approx_cost(for two people),listed_in(type)
51712,Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.6 /5,27,Whitefield,Continental,"1,500",Pubs and bars
51713,Vinod Bar And Restaurant,No,No,NaN,0,Whitefield,Finger Food,600,Pubs and bars
51714,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,NaN,0,Whitefield,Finger Food,"2,000",Pubs and bars
51715,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.3 /5,236,"ITPL Main Road, Whitefield",Finger Food,"2,500",Pubs and bars
51716,The Nest - The Den Bengaluru,No,No,3.4 /5,13,"ITPL Main Road, Whitefield","Finger Food, North Indian, Continental","1,500",Pubs and bars

In [16]:
len(df)

51717

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         51717 non-null  object
 1   online_order                 51717 non-null  object
 2   book_table                   51717 non-null  object
 3   rate                         43942 non-null  object
 4   votes                        51717 non-null  int64
 5   location                     51696 non-null  object
 6   cuisines                     51672 non-null  object
 7   approx_cost(for two people)  51371 non-null  object
 8   listed_in(type)              51717 non-null  object
dtypes: int64(1), object(8)
memory usage: 3.6+ MB

### Handling the duplicate records

In [18]:
#checking if we have duplicate records or not. Returns True or False. 

df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
51712    False
51713    False
51714    False
51715    False
51716    False
Length: 51717, dtype: bool

In [19]:
df.duplicated().sum() #total this records or rows are identical and duplicate

16730

In [20]:
df.loc[df.duplicated()] #all this are duplicate records

,name,online_order,book_table,rate,votes,location,cuisines,approx_cost(for two people),listed_in(type)
596,My Tea House,Yes,Yes,NEW,0,Banashankari,"Continental, Asian, North Indian, Tea",500,Dine-out
2235,Shiv Sagar,No,No,3.6/5,10,Bannerghatta Road,"South Indian, Beverages",400,Dine-out
2482,Grand Village,No,No,3.8/5,166,Basavanagudi,"North Indian, Rajasthani",600,Buffet
2483,Timepass Dinner,Yes,No,3.8/5,286,Basavanagudi,North Indian,600,Buffet
2488,Jalsa,Yes,Yes,4.1/5,775,Banashankari,"North Indian, Mughlai, Chinese",800,Buffet
...,...,...,...,...,...,...,...,...,...
51633,Re:fuel- Aloft Bengaluru Cessna Business Park,No,No,NaN,0,Bellandur,"Bakery, Beverages, Cafe, Coffee, Desserts, San...","1,000",Dine-out
51637,The Crunch,No,No,3.3 /5,6,Brookefield,Beverages,300,Dine-out
51639,Kale Cafe,No,No,NaN,0,Brookefield,"Fast Food, Kerala",100,Dine-out
51642,Basaveshwara Khanavali,No,No,NaN,0,Brookefield,South Indian,200,Dine-out
51679,Unlock - The Restobar - Keys Hotel,No,No,3.7 /5,32,Whitefield,Finger Food,"2,000",Drinks & nightlife

### Dropping the duplicate records and resetting the index

In [21]:
df = df.drop_duplicates()

In [22]:
df = df.reset_index(drop=True) #drop=True, you drop the old index, and a new index is created

In [23]:
df.shape

(34987, 9)

In [24]:
df.head()

,name,online_order,book_table,rate,votes,location,cuisines,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,Banashankari,"North Indian, Mughlai, Chinese",800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,Banashankari,"Chinese, North Indian, Thai",800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,Banashankari,"Cafe, Mexican, Italian",800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,Banashankari,"South Indian, North Indian",300,Buffet
4,Grand Village,No,No,3.8/5,166,Basavanagudi,"North Indian, Rajasthani",600,Buffet

In [25]:
df.tail()

,name,online_order,book_table,rate,votes,location,cuisines,approx_cost(for two people),listed_in(type)
34982,Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.6 /5,27,Whitefield,Continental,"1,500",Pubs and bars
34983,Vinod Bar And Restaurant,No,No,NaN,0,Whitefield,Finger Food,600,Pubs and bars
34984,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,NaN,0,Whitefield,Finger Food,"2,000",Pubs and bars
34985,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.3 /5,236,"ITPL Main Road, Whitefield",Finger Food,"2,500",Pubs and bars
34986,The Nest - The Den Bengaluru,No,No,3.4 /5,13,"ITPL Main Road, Whitefield","Finger Food, North Indian, Continental","1,500",Pubs and bars

### Checking the unique values for columsn to see all is well.

In [26]:
df["online_order"].unique()

array(['Yes', 'No'], dtype=object)

In [27]:
df["book_table"].unique()

array(['Yes', 'No'], dtype=object)

In [28]:
df["listed_in(type)"].unique()

array(['Buffet', 'Cafes', 'Delivery', 'Desserts', 'Dine-out',
       'Drinks & nightlife', 'Pubs and bars'], dtype=object)

### Replacing incorrect datapoints and splitting values for rate column

In [29]:
def handlerate(value):
    if(value=='NEW' or value=='-'):
        return np.nan
    else:
        value = str(value).split('/')
        value = value[0]
        return float(value)
    
df['rate'] = df['rate'].apply(handlerate)

In [30]:
df["rate"].unique()

array([4.1, 3.8, 3.7, 3.6, 4.6, 4. , 4.2, 3.9, 3.1, 3. , 3.2, 3.3, 2.8,
       4.4, 4.3, nan, 2.9, 3.5, 2.6, 3.4, 4.5, 2.5, 2.7, 4.7, 2.4, 2.2,
       2.3, 4.8, 4.9, 2.1, 2. , 1.8])

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34987 entries, 0 to 34986
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         34987 non-null  object
 1   online_order                 34987 non-null  object
 2   book_table                   34987 non-null  object
 3   rate                         29900 non-null  float64
 4   votes                        34987 non-null  int64
 5   location                     34973 non-null  object
 6   cuisines                     34954 non-null  object
 7   approx_cost(for two people)  34766 non-null  object
 8   listed_in(type)              34987 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 2.4+ MB

### Filling Null Values in Rate Column with Mean

In [32]:
df["rate"].isnull().sum()

5087

In [33]:
df["rate"].mean()

3.7306789297658867

In [34]:
#using fillna method.

df["rate"] = df["rate"].fillna(df["rate"].mean())

In [35]:
df["rate"].isnull().sum()

0

In [36]:
### Check for all columns with null values

df.isnull().sum()

name                             0
online_order                     0
book_table                       0
rate                             0
votes                            0
location                        14
cuisines                        33
approx_cost(for two people)    221
listed_in(type)                  0
dtype: int64

In [37]:
### Dropping all other rows with null values - the above 3 fields

df.dropna(inplace=True)

In [38]:
df.isnull().sum()

name                           0
online_order                   0
book_table                     0
rate                           0
votes                          0
location                       0
cuisines                       0
approx_cost(for two people)    0
listed_in(type)                0
dtype: int64

### Renaming the columns

In [39]:
df.columns

Index(['name', 'online_order', 'book_table', 'rate', 'votes', 'location',
       'cuisines', 'approx_cost(for two people)', 'listed_in(type)'],
      dtype='object')

In [40]:
df = df.rename({"rate":"ratings","approx_cost(for two people)":"costfor2","listed_in(type)":"category"}, axis=1)

In [41]:
df.head()

,name,online_order,book_table,ratings,votes,location,cuisines,costfor2,category
0,Jalsa,Yes,Yes,4.1,775,Banashankari,"North Indian, Mughlai, Chinese",800,Buffet
1,Spice Elephant,Yes,No,4.1,787,Banashankari,"Chinese, North Indian, Thai",800,Buffet
2,San Churro Cafe,Yes,No,3.8,918,Banashankari,"Cafe, Mexican, Italian",800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7,88,Banashankari,"South Indian, North Indian",300,Buffet
4,Grand Village,No,No,3.8,166,Basavanagudi,"North Indian, Rajasthani",600,Buffet

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34752 entries, 0 to 34986
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          34752 non-null  object
 1   online_order  34752 non-null  object
 2   book_table    34752 non-null  object
 3   ratings       34752 non-null  float64
 4   votes         34752 non-null  int64
 5   location      34752 non-null  object
 6   cuisines      34752 non-null  object
 7   costfor2      34752 non-null  object
 8   category      34752 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 2.7+ MB

### checking the costfor2 unique values and replacing the "," with blank to convert into float or int

In [43]:
df["costfor2"].unique()

array(['800', '300', '600', '700', '550', '500', '450', '650', '400',
       '900', '200', '750', '150', '850', '100', '1,200', '350', '250',
       '950', '1,000', '1,500', '1,300', '199', '80', '1,100', '160',
       '1,600', '230', '130', '50', '190', '1,700', '1,400', '180',
       '1,350', '2,200', '2,000', '1,800', '1,900', '330', '2,500',
       '2,100', '3,000', '2,800', '3,400', '40', '1,250', '3,500',
       '4,000', '2,400', '2,600', '120', '1,450', '469', '70', '3,200',
       '60', '560', '240', '360', '6,000', '1,050', '2,300', '4,100',
       '5,000', '3,700', '1,650', '2,700', '4,500', '140'], dtype=object)

In [44]:
df["costfor2"] = df["costfor2"].str.replace(",","").astype(float)

In [45]:
df["costfor2"].unique()

array([ 800.,  300.,  600.,  700.,  550.,  500.,  450.,  650.,  400.,
        900.,  200.,  750.,  150.,  850.,  100., 1200.,  350.,  250.,
        950., 1000., 1500., 1300.,  199.,   80., 1100.,  160., 1600.,
        230.,  130.,   50.,  190., 1700., 1400.,  180., 1350., 2200.,
       2000., 1800., 1900.,  330., 2500., 2100., 3000., 2800., 3400.,
         40., 1250., 3500., 4000., 2400., 2600.,  120., 1450.,  469.,
         70., 3200.,   60.,  560.,  240.,  360., 6000., 1050., 2300.,
       4100., 5000., 3700., 1650., 2700., 4500.,  140.])

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34752 entries, 0 to 34986
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          34752 non-null  object
 1   online_order  34752 non-null  object
 2   book_table    34752 non-null  object
 3   ratings       34752 non-null  float64
 4   votes         34752 non-null  int64
 5   location      34752 non-null  object
 6   cuisines      34752 non-null  object
 7   costfor2      34752 non-null  float64
 8   category      34752 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 2.7+ MB

In [47]:
df["costfor2"].sum() #its works

20634937.0

### Cleaning up "location" column. To make every location with less than 300 entries  as "Others"

In [48]:
df["location"].nunique()

93

In [49]:
location = df["location"].value_counts(ascending=True)
location

location
Peenya                     1
Jakkur                     1
Rajarajeshwari Nagar       2
Nagarbhavi                 4
Yelahanka                  5
                        ...
Marathahalli            1665
Indiranagar             1748
HSR                     1760
Whitefield              1958
BTM                     2499
Name: count, Length: 93, dtype: int64

In [50]:
locationlessthan300 = location[location<300]
locationlessthan300

location
Peenya                             1
Jakkur                             1
Rajarajeshwari Nagar               2
Nagarbhavi                         4
Yelahanka                          5
Central Bangalore                  5
Kengeri                            5
West Bangalore                     6
North Bangalore                   10
Uttarahalli                       13
Hebbal                            14
Langford Town                     16
KR Puram                          17
Old Madras Road                   18
Kanakapura Road                   19
Rammurthy Nagar                   19
Mysore Road                       21
Koramangala                       21
Sankey Road                       21
Magadi Road                       34
Jalahalli                         34
East Bangalore                    37
Koramangala 2nd Block             46
Hosur Road                        47
South Bangalore                   51
Sahakara Nagar                    53
Sadashiv Nagar                    62
RT Nagar                          64
Sanjay Nagar                      72
Vijay Nagar                       75
CV Raman Nagar                    79
Kaggadasapura                     81
Infantry Road                     84
City Market                       84
Race Course Road                  94
Yeshwantpur                       95
HBR Layout                        99
ITPL Main Road, Whitefield       102
Varthur Main Road, Whitefield    103
Hennur                           106
Seshadripuram                    115
Nagawara                         117
Majestic                         119
Wilson Garden                    128
Koramangala 3rd Block            129
Kumaraswamy Layout               132
Koramangala 8th Block            147
Ejipura                          157
Commercial Street                164
Shivajinagar                     167
Basaveshwara Nagar               173
Thippasandra                     176
Vasanth Nagar                    180
Bommanahalli                     180
St. Marks Road                   244
Shanti Nagar                     256
Jeevan Bhima Nagar               262
Cunningham Road                  285
Name: count, dtype: int64

In [51]:
def handle_location(value):
    if(value in locationlessthan300):
        return 'others'
    else:
        return value
        
df['location'] = df['location'].apply(handle_location)
df['location'].value_counts()

location
others                   4851
BTM                      2499
Whitefield               1958
HSR                      1760
Indiranagar              1748
Marathahalli             1665
Koramangala 5th Block    1605
JP Nagar                 1405
Jayanagar                1243
Electronic City          1220
Bellandur                1134
Bannerghatta Road        1054
Sarjapur Road             938
Brigade Road              684
Koramangala 7th Block     623
Brookefield               598
Koramangala 6th Block     595
Kalyan Nagar              589
Koramangala 4th Block     587
New BEL Road              584
Banashankari              570
Malleshwaram              556
MG Road                   554
Ulsoor                    546
Koramangala 1st Block     538
Frazer Town               469
Basavanagudi              463
Rajajinagar               462
Church Street             446
Banaswadi                 432
Residency Road            423
Kammanahalli              420
Old Airport Road          405
Lavelle Road              396
Richmond Road             387
Domlur                    345
Name: count, dtype: int64

### Cleaning up "cuisine" column. To make every cuisine with less than 100 entries  as "Others"

In [52]:
df["cuisines"].unique()

array(['North Indian, Mughlai, Chinese', 'Chinese, North Indian, Thai',
       'Cafe, Mexican, Italian', ...,
       'North Indian, Street Food, Biryani', 'Chinese, Mughlai',
       'North Indian, Chinese, Arabian, Momos'], dtype=object)

In [53]:
cuisines = df["cuisines"].value_counts(ascending=True)
cuisines

cuisines
North Indian, Bengali, South Indian          1
North Indian, Chinese, Andhra, Seafood       1
Singaporean, Chinese, Thai, Malaysian        1
Andhra, North Indian, Biryani, Seafood       1
Chinese, Vietnamese, Thai, Malaysian         1
                                          ...
Biryani                                    560
Bakery, Desserts                           593
South Indian                              1171
North Indian, Chinese                     1570
North Indian                              1907
Name: count, Length: 2715, dtype: int64

In [54]:
cuisineslessthan100 = cuisines[cuisines<100]
cuisineslessthan100

cuisines
North Indian, Bengali, South Indian        1
North Indian, Chinese, Andhra, Seafood     1
Singaporean, Chinese, Thai, Malaysian      1
Andhra, North Indian, Biryani, Seafood     1
Chinese, Vietnamese, Thai, Malaysian       1
                                          ..
North Indian, Chinese, Continental        82
North Indian, Continental                 95
North Indian, Street Food                 96
Fast Food, Burger                         97
Cafe, Desserts                            99
Name: count, Length: 2662, dtype: int64

In [55]:
def handle_cuisine(value):
    if(value in cuisineslessthan100):
        return "others"
    else:
        return value

df["cuisines"] = df["cuisines"].apply(handle_cuisine)
df["cuisines"].value_counts()

cuisines
others                                              19682
North Indian                                         1907
North Indian, Chinese                                1570
South Indian                                         1171
Bakery, Desserts                                      593
Biryani                                               560
Fast Food                                             485
South Indian, North Indian, Chinese                   475
Desserts                                              447
Cafe                                                  447
Bakery                                                387
Chinese                                               338
Ice Cream, Desserts                                   304
Mithai, Street Food                                   260
Chinese, North Indian                                 253
North Indian, Chinese, Biryani                        238
North Indian, South Indian                            230
Desserts, Ice Cream                                   226
North Indian, South Indian, Chinese                   212
South Indian, North Indian                            207
Finger Food                                           200
North Indian, Biryani                                 190
Desserts, Beverages                                   186
Biryani, North Indian                                 179
Street Food                                           179
Biryani, Kebab                                        174
Cafe, Fast Food                                       164
Chinese, Momos                                        162
Beverages, Fast Food                                  159
South Indian, Biryani                                 152
Beverages                                             151
Burger, Fast Food                                     147
South Indian, Chinese                                 145
North Indian, Mughlai                                 144
South Indian, North Indian, Chinese, Street Food      142
Desserts, Bakery                                      139
Kerala                                                135
Fast Food, Beverages                                  130
Ice Cream                                             130
North Indian, Fast Food                               129
Continental                                           128
Cafe, Continental                                     126
Pizza, Fast Food                                      125
Bakery, Fast Food                                     123
Fast Food, Rolls                                      120
Chinese, Thai                                         120
Biryani, North Indian, Chinese                        119
North Indian, Chinese, Fast Food                      115
North Indian, Chinese, South Indian                   114
Andhra                                                114
Pizza                                                 110
Biryani, Fast Food                                    105
Arabian                                               102
Andhra, Biryani                                       102
Name: count, dtype: int64

### Checking Category

In [56]:
df["category"].unique()

array(['Buffet', 'Cafes', 'Delivery', 'Desserts', 'Dine-out',
       'Drinks & nightlife', 'Pubs and bars'], dtype=object)

In [57]:
df["category"].value_counts(ascending=True)

category
Pubs and bars           597
Buffet                  669
Drinks & nightlife      902
Cafes                  1238
Desserts               2457
Dine-out              12834
Delivery              16055
Name: count, dtype: int64

## Analysis

In [58]:
df.head()

,name,online_order,book_table,ratings,votes,location,cuisines,costfor2,category
0,Jalsa,Yes,Yes,4.1,775,Banashankari,others,800.0,Buffet
1,Spice Elephant,Yes,No,4.1,787,Banashankari,others,800.0,Buffet
2,San Churro Cafe,Yes,No,3.8,918,Banashankari,others,800.0,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7,88,Banashankari,"South Indian, North Indian",300.0,Buffet
4,Grand Village,No,No,3.8,166,Basavanagudi,others,600.0,Buffet

In [59]:
df.tail()

,name,online_order,book_table,ratings,votes,location,cuisines,costfor2,category
34982,Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.600000,27,Whitefield,Continental,1500.0,Pubs and bars
34983,Vinod Bar And Restaurant,No,No,3.730679,0,Whitefield,Finger Food,600.0,Pubs and bars
34984,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,3.730679,0,Whitefield,Finger Food,2000.0,Pubs and bars
34985,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.300000,236,others,Finger Food,2500.0,Pubs and bars
34986,The Nest - The Den Bengaluru,No,No,3.400000,13,others,others,1500.0,Pubs and bars

### Descriptive Statistics - Central Tendancy

In [60]:
df["ratings"].mean()

3.731112997995929

In [61]:
df["ratings"].max()

4.9

In [62]:
df["ratings"].min()

1.8

In [63]:
df["ratings"].mode()

0    3.730679
Name: ratings, dtype: float64

In [64]:
s = df.sort_values(["ratings"])
s["ratings"].median()

3.7306789297658867

In [65]:
#simple way

df.describe()

            ratings         votes      costfor2
count  34752.000000  34752.000000  34752.000000
mean       3.731113    363.665372    593.776962
std        0.418975    942.516535    462.454135
min        1.800000      0.000000     40.000000
25%        3.500000     11.000000    300.000000
50%        3.730679     59.000000    450.000000
75%        4.000000    272.000000    700.000000
max        4.900000  16832.000000   6000.000000

In [66]:
df.head()

,name,online_order,book_table,ratings,votes,location,cuisines,costfor2,category
0,Jalsa,Yes,Yes,4.1,775,Banashankari,others,800.0,Buffet
1,Spice Elephant,Yes,No,4.1,787,Banashankari,others,800.0,Buffet
2,San Churro Cafe,Yes,No,3.8,918,Banashankari,others,800.0,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7,88,Banashankari,"South Indian, North Indian",300.0,Buffet
4,Grand Village,No,No,3.8,166,Basavanagudi,others,600.0,Buffet

In [67]:
df.tail()

,name,online_order,book_table,ratings,votes,location,cuisines,costfor2,category
34982,Best Brews - Four Points by Sheraton Bengaluru...,No,No,3.600000,27,Whitefield,Continental,1500.0,Pubs and bars
34983,Vinod Bar And Restaurant,No,No,3.730679,0,Whitefield,Finger Food,600.0,Pubs and bars
34984,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,3.730679,0,Whitefield,Finger Food,2000.0,Pubs and bars
34985,Chime - Sheraton Grand Bengaluru Whitefield Ho...,No,Yes,4.300000,236,others,Finger Food,2500.0,Pubs and bars
34986,The Nest - The Den Bengaluru,No,No,3.400000,13,others,others,1500.0,Pubs and bars

## Research Analysis

#### Number of restaurants in each location? Filter top 20

In [81]:
top20 = df.groupby("location")["name"].count().reset_index()
top20.drop(35,inplace=True) #others all together hotel
top20.sort_values("name",ascending=False).head(20)

                 location  name
0                     BTM  2499
34             Whitefield  1958
12                    HSR  1760
13            Indiranagar  1748
26           Marathahalli  1665
20  Koramangala 5th Block  1605
14               JP Nagar  1405
15              Jayanagar  1243
10        Electronic City  1220
5               Bellandur  1134
3       Bannerghatta Road  1054
32          Sarjapur Road   938
6            Brigade Road   684
22  Koramangala 7th Block   623
7             Brookefield   598
21  Koramangala 6th Block   595
16           Kalyan Nagar   589
19  Koramangala 4th Block   587
27           New BEL Road   584
1            Banashankari   570

#### Restaurants have book table facility and how many don’t?

In [83]:
booking = df.groupby("book_table")["name"].count()
booking

book_table
No     29351
Yes     5401
Name: name, dtype: int64

#### Restaurants have online order facility and how many don’t?

In [84]:
online = df.groupby("online_order")["name"].count()
online

online_order
No     13963
Yes    20789
Name: name, dtype: int64

#### Average rating of restaurants with book table facility got?

In [94]:
avg_book_table_rating = df.loc[df["book_table"]=="Yes"] #filtering the Yes
avg_book_table_rating["ratings"].mean().round(2) #calculating the average

4.16

#### Average rating of restaurants with online table facility got?

In [93]:
avg_book_online_rating = df.loc[df["online_order"]=="Yes"]
avg_book_online_rating["ratings"].mean().round(2)

3.75

#### Average cost of 2 based on locations

In [100]:
avg_cost_by_location = df.groupby("location")["costfor2"].mean().round(2).reset_index()
avg_cost_by_location.sort_values("costfor2",ascending=False).head(10)

                 location  costfor2
23           Lavelle Road   1399.37
24                MG Road   1263.09
30         Residency Road   1041.02
31          Richmond Road    898.32
8           Church Street    881.95
33                 Ulsoor    822.07
19  Koramangala 4th Block    787.14
6            Brigade Road    771.81
20  Koramangala 5th Block    757.35
28       Old Airport Road    697.95

#### Average customer ratings based on locations

In [107]:
avg_rating_locations = df.groupby("location")["ratings"].mean().round(2).reset_index()
avg_rating_locations.sort_values("ratings",ascending=False).head(10) #top10

                 location  ratings
23           Lavelle Road     4.16
20  Koramangala 5th Block     4.08
8           Church Street     4.06
19  Koramangala 4th Block     3.98
24                MG Road     3.94
30         Residency Road     3.93
22  Koramangala 7th Block     3.93
31          Richmond Road     3.89
21  Koramangala 6th Block     3.85
13            Indiranagar     3.85

In [108]:
avg_rating_locations.sort_values("ratings",ascending=True).head(10) #bottom 10

             location  ratings
2           Banaswadi     3.55
5           Bellandur     3.56
26       Marathahalli     3.57
9              Domlur     3.57
10    Electronic City     3.57
3   Bannerghatta Road     3.58
7         Brookefield     3.62
0                 BTM     3.64
29        Rajajinagar     3.65
34         Whitefield     3.65

#### which cuisines have the most positive ratings?

In [122]:
cuisine_ratings = df.groupby("cuisines")["ratings"].mean().round(2).reset_index()
cuisine_ratings = cuisine_ratings.sort_values("ratings",ascending=False)
cuisine_ratings.head(10)

                 cuisines  ratings
24    Desserts, Beverages     4.07
41  North Indian, Mughlai     3.91
15      Cafe, Continental     3.90
25    Desserts, Ice Cream     3.89
18         Chinese, Momos     3.87
31    Ice Cream, Desserts     3.87
53                 others     3.81
22               Desserts     3.79
23       Desserts, Bakery     3.77
2                 Arabian     3.74

In [123]:
cuisine_ratings.tail(10)

                            cuisines  ratings
26                         Fast Food     3.55
8                            Biryani     3.53
38  North Indian, Chinese, Fast Food     3.53
28                  Fast Food, Rolls     3.52
0                             Andhra     3.51
45                  Pizza, Fast Food     3.48
19             Chinese, North Indian     3.48
36             North Indian, Chinese     3.46
11             Biryani, North Indian     3.43
16                   Cafe, Fast Food     3.37

#### average cost of cuisines in different locations

In [130]:
avg_cuisine_cost = df.groupby(["cuisines","location"])["costfor2"].mean().round(2).reset_index()
avg_cuisine_cost.sort_values("costfor2",ascending=False).head(20)

                        cuisines          location  costfor2
1055       North Indian, Mughlai     Richmond Road   3500.00
556                  Continental     Richmond Road   3000.00
477               Chinese, Momos           MG Road   3000.00
552                  Continental           MG Road   2800.00
896                 North Indian    Residency Road   2546.67
448                      Chinese           MG Road   2500.00
551                  Continental      Lavelle Road   2500.00
764                  Finger Food    Residency Road   2264.71
754                  Finger Food      Basavanagudi   2200.00
765                  Finger Food     Richmond Road   2000.00
1078  North Indian, South Indian  Old Airport Road   2000.00
553                  Continental      Malleshwaram   2000.00
1052       North Indian, Mughlai      Malleshwaram   1833.33
763                  Finger Food  Old Airport Road   1800.00
1058       North Indian, Mughlai            others   1766.67
454                      Chinese    Residency Road   1730.00
464               Chinese, Momos     Church Street   1700.00
890                 North Indian           MG Road   1633.33
767                  Finger Food        Whitefield   1632.26
766                  Finger Food            Ulsoor   1500.00

In [131]:
avg_cuisine_cost.sort_values("costfor2",ascending=False).tail(20)

                                 cuisines               location  costfor2
41                                Arabian              Bellandur    150.00
1322                          Street Food              Banaswadi    140.00
735                      Fast Food, Rolls              Bellandur    137.50
1332                          Street Food              Jayanagar    135.71
1333                          Street Food           Kalyan Nagar    135.71
1196                South Indian, Biryani           Basavanagudi    133.33
1327                          Street Food        Electronic City    130.00
1334                          Street Food           Kammanahalli    126.67
1321                          Street Food           Banashankari    125.00
719                  Fast Food, Beverages  Koramangala 5th Block    125.00
160                             Beverages            Frazer Town    100.00
784                             Ice Cream           Marathahalli    100.00
154                             Beverages              Banaswadi    100.00
855                   Mithai, Street Food  Koramangala 1st Block    100.00
697                             Fast Food          Richmond Road    100.00
1343                          Street Food          Sarjapur Road    100.00
568                              Desserts                 Domlur    100.00
733                      Fast Food, Rolls      Bannerghatta Road    100.00
156                             Beverages           Basavanagudi    100.00
1277  South Indian, North Indian, Chinese                 Domlur     40.00